const emojipedia = [
  {
    id: 1,
    emoji: "😄",
    name: "புன்னகைக்கும் கண்களுடன் முகம் சிரிக்கிறது",
    meaning:
      "சிரிக்கும் கண்களும், பரந்த, திறந்த புன்னகையும் கொண்ட மஞ்சள் முகம், மேல் பற்களையும் நாக்கையும் காட்டுகிறது. பெரும்பாலும் பொதுவான மகிழ்ச்சியையும் நல்ல குணமுள்ள கேளிக்கைகளையும் தெரிவிக்கிறது"
  },
  {
    id: 2,
    emoji: "😀",
    name: "சிரிக்கும் முகம்",
    meaning:
      "எளிமையான, திறந்த கண்கள் மற்றும் பரந்த, திறந்த புன்னகையுடன் கூடிய மஞ்சள் முகம், சில தளங்களில் மேல் பற்களையும் நாக்கையும் காட்டுகிறது. பெரும்பாலும் பொதுவான இன்பத்தையும் நல்ல உற்சாகத்தையும் நகைச்சுவையையும் தெரிவிக்கிறது."
  },
  {
    id: 3,
    emoji: "😃",
    name: "பெரிய கண்களுடன் முகம் சிரிக்கிறது",
    meaning:
      "சிரிக்கும் கண்களும், பரந்த, திறந்த புன்னகையும் கொண்ட மஞ்சள் முகம், சில தளங்களில் மேல் பற்களையும் நாக்கையும் காட்டுகிறது. பெரும்பாலும் பொதுவான மகிழ்ச்சியையும் நல்ல குணமுள்ள கேளிக்கைகளையும் தெரிவிக்கிறது."
  },
  {
    id: 4,
    emoji: "😄",
    name: "புன்னகைக்கும் கண்களுடன் முகம் சிரிக்கிறது",
    meaning:
      "சிரிக்கும் கண்களும், பரந்த, திறந்த புன்னகையும் கொண்ட மஞ்சள் முகம், சில தளங்களில் மேல் பற்களையும் நாக்கையும் காட்டுகிறது. பெரும்பாலும் பொதுவான மகிழ்ச்சியையும் நல்ல குணமுள்ள கேளிக்கைகளையும் தெரிவிக்கிறது."
  },
  {
    id: 5,
    emoji: "😁",
    name: "புன்னகைக்கும் கண்களுடன் முகம்",
    meaning:
      "சிரிக்கும் கண்களும், முழு பல் சிரிப்பும் கொண்ட ஒரு மஞ்சள் முகம், சீஸ் என்று சொல்வது போல! கேமராவுக்கு. பற்கள் மென்மையாக்கப்படலாம் அல்லது குறுக்குவெட்டுடன் இருக்கலாம். பெரும்பாலும் ஒரு கதிரியக்க, மகிழ்ச்சியான மகிழ்ச்சியை வெளிப்படுத்துகிறது. சூடான, வேடிக்கையான, வேடிக்கையான அல்லது பெருமை உட்பட தொனி மாறுபடும்."
  },
  {
    id: 6,
    emoji: "😆",
    name: "சிரிக்கும் முகம் சுருகதுடன்",
    meaning:
      "அகன்ற, திறந்த புன்னகையுடன், மஞ்சள் நிற முகம் கொண்ட, எக்ஸ் வடிவ கண்கள். பெரும்பாலும் உற்சாகத்தை அல்லது மனம் நிறைந்த சிரிப்பை வெளிப்படுத்துகிறது"
  },
  {
    id: 7,
    emoji: "😅",
    name: "வியர்வையுடன் முகம் சிரிக்கிறது",
    meaning:
      "சிரிக்கும் கண்களுடன் முகத்தை சிரிப்பதைப் போலவே அதே சிரிப்பும் கண்களும் உள்ளன, ஆனால் ஒற்றை, நீல நிற மணியுடன், பொதுவாக அதன் இடது கண்ணுக்கு மேல். அப்பாடா என்று சொல்வது போல! மற்றும் நெற்றியில் இருந்து வியர்வையைத் துடைப்பது."
  },
  {
    id: 8,
    emoji: "🤣",
    name: "சிரித்து சிரித்து வீழ்வது",
    meaning:
      "ஒரு பெரிய புன்னகையுடன் கூடிய மஞ்சள் முகம், சுருட்டப்பட்ட, எக்ஸ் வடிவ கண்கள், தரையில் சிரிப்பது போல அதன் பக்கத்தில் சாய்ந்து (இணைய சுருக்கெழுத்து ROFL). இரண்டு கண்ணீரைப் பொழிந்து, பெரும்பாலான தளங்களில் சாய்கிறது. 😂 கண்ணீருடன் மகிழ்ச்சி என்பதை விட வெறித்தனமான சிரிப்பை பெரும்பாலும் வெளிப்படுத்துகிறது."
  },
  {
    id: 9,
    emoji: "😂",
    name: "கண்ணீருடன் மகிழ்ச்சி",
    meaning:
      "ஒரு பெரிய சிரிப்பு, உயர்த்தப்பட்ட புருவங்கள் மற்றும் புன்னகைக்கும் கண்கள் கொண்ட மஞ்சள் முகம், ஒவ்வொன்றும் மிகவும் கடினமாக சிரிப்பதில் இருந்து ஒரு கண்ணீரைப் பொழிகின்றன. எதையாவது காட்ட பரவலாகப் பயன்படுத்துவது வேடிக்கையானது அல்லது மகிழ்ச்சி அளிக்கிறது."
  },
  {
    id: 10,
    emoji: "🙂",
    name: "லேசாக சிரிக்கும் முகம்",
    meaning:
      "எளிமையான, திறந்த கண்கள் மற்றும் மெல்லிய, மூடிய புன்னகையுடன் மஞ்சள் முகம். பலவிதமான நேர்மறை, மகிழ்ச்சியான மற்றும் நட்பு உணர்வுகளை வெளிப்படுத்துகிறது. அதன் தொனி ஆதரவளிக்கும், செயலற்ற-ஆக்கிரமிப்பு அல்லது முரண்பாடாக இருக்கலாம், இது உண்மையில் இல்லாதபோது இது நல்லது என்று சொல்வது போல."
  },
  {
    id: 11,
    emoji: "🙃",
    name: "தலைகீழான முகம்",
    meaning:
      "ஒரு உன்னதமான ஸ்மைலி, தலைகீழாக மாறியது. பெரும்பாலான தளங்களில் 🙂 சற்று சிரிக்கும் முகத்தின் புரட்டப்பட்ட பதிப்பாக செயல்படுத்தப்பட்டது."
  },
  {
    id: 12,
    emoji: "😉",
    name: "கண் சிமிட்டும் முகம்",
    meaning:
      "லேசான புன்னகையுடன் மஞ்சள் முகம் கண் சிமிட்டுவதைக் காட்டியது, பொதுவாக அதன் இடது கண். நகைச்சுவை, ஊர்சுற்றல், மறைக்கப்பட்ட பொருள் அல்லது பொதுவான நேர்மறை ஆகியவற்றைக் குறிக்கலாம். விளையாட்டுத்தனமான, பாசமுள்ள, பரிந்துரைக்கும் அல்லது முரண் உட்பட தொனி மாறுபடும்."
  },
  {
    id: 13,
    emoji: "😊",
    name: "சிரிக்கும் கண்களுடன் சிரிக்கும் முகம்",
    meaning:
      "சிரிக்கும் கண்களுடன் ஒரு மஞ்சள் முகம் மற்றும் பரந்த, மூடிய புன்னகை ரோஸி கன்னங்கள் வரை திரும்பும். பெரும்பாலும் உண்மையான மகிழ்ச்சி மற்றும் சூடான, நேர்மறையான உணர்வுகளை வெளிப்படுத்துகிறது."
  },
  {
    id: 14,
    emoji: "😇",
    name: "ஒளிவட்டதுடன் சிரிக்கும் முகம்",
    meaning:
      "சிரிக்கும் கண்கள், மூடிய புன்னகை மற்றும் ஒளிவட்டம், பொதுவாக நீலம், மேல்நிலை கொண்ட மஞ்சள் முகம். பெரும்பாலும் தேவதூதர்கள், பிரார்த்தனைகள் மற்றும் ஆசீர்வாதங்களை குறிக்கிறது. தேவதூதர் நடத்தையையும் தெரிவிக்கலாம், எ.கா., நல்ல செயல்களைச் செய்யலாம்"
  },
  {
    id: 15,
    emoji: "🥰",
    name: "இதயங்களுடன் சிரிக்கும் முகம்",
    meaning:
      "சிரித்த கண்கள், மூடிய புன்னகை, ரோஸி கன்னங்கள் மற்றும் பல இதயங்கள் அதன் தலையைச் சுற்றி மிதக்கும் மஞ்சள் முகம். மகிழ்ச்சியான, பாசமுள்ள உணர்வுகளின் வரம்பை வெளிப்படுத்துகிறது, குறிப்பாக காதலில் இருப்பது. இதயங்களின் எண்ணிக்கை (மூன்று அல்லது அதற்கு மேற்பட்டவை) தளத்தால் மாறுபடும்."
  },
  {
    id: 16,
    emoji: "😍",
    name: "இதயக் கண்களுடன் சிரிக்கும் முகம்",
    meaning:
      "திறந்த புன்னகையுடன் ஒரு மஞ்சள் முகம், சில நேரங்களில் பற்களைக் காண்பிக்கும், மற்றும் கண்களுக்கு சிவப்பு, கார்ட்டூன் பாணியிலான இதயங்கள். பெரும்பாலும் அன்பு, மோகம் மற்றும் வணக்கம் போன்ற உற்சாகமான உணர்வுகளை வெளிப்படுத்துகிறது, எ.கா., நான் இந்த நபரை அல்லது விஷயத்தை நேசிக்கிறேன் / நேசிக்கிறேன்."
  },
  {
    id: 17,
    emoji: "🤩",
    name: "ஸ்டார் ஸ ்ட்ரக்",
    meaning:
      "ஒரு பரந்த, திறந்த புன்னகையுடன் ஒரு மஞ்சள் முகம், பெரும்பாலான தளங்களில் மேல் பற்களைக் காண்பிக்கும், கண்களுக்கு நட்சத்திரங்களுடன், ஒரு பிரியமான பிரபலத்தைப் பார்ப்பது போல. நட்சத்திரங்களின் நிறம் பொதுவாக தங்கம் அல்லது சிவப்பு என்றாலும் மேடையில் மாறுபடும். யாரோ அல்லது ஏதோ ஆச்சரியமான, கவர்ச்சிகரமான, ஈர்க்கக்கூடிய அல்லது உற்சாகமானவர் என்பதை வெளிப்படுத்தலாம்."
  },
  {
    id: 18,
    emoji: "😘",
    name: " ஒரு முத்தத்தை வீசும் உதடுகளால் மஞ்சள் நிற முகம்",
    meaning:
      "ஒரு சிறிய, சிவப்பு இதயமாக சித்தரிக்கப்பட்ட ஒரு முத்தத்தை வீசும் உதடுகளால் மஞ்சள் நிற முகம். ஒரு முத்த குட்பை அல்லது நல்ல இரவைக் குறிக்கலாம் மற்றும் பொதுவாக அன்பு மற்றும் பாசத்தின் உணர்வுகளை வெளிப்படுத்தலாம்."
  },
  {
    id: 19,
    emoji: "😗",
    name: "முகம் முத்தம் கொடுப்பது",
    meaning:
      "திறந்த கண்கள் மற்றும் குத்தப்பட்ட உதடுகளைக் கொண்ட மஞ்சள் முகம் ஒரு முத்தத்தைக் கொடுக்கும். பொதுவாக அன்பு மற்றும் பாசத்தின் உணர்வுகளை வெளிப்படுத்துகிறது."
  },
  {
    id: 20,
    emoji: "😚",
    name: " மூடிய கண்களால் முகத்தை முத்தமிடுவது",
    meaning:
      "சிரிக்கும் கண்கள், ரோஸி கன்னங்கள், மற்றும் உதட்டைக் கொண்ட உதடுகளுடன் ஒரு மஞ்சள் முகம். பொதுவாக காதல் காதல் மற்றும் பாசத்தின் உணர்வுகளை வெளிப்படுத்துகிறது. மூடிய கண்களால், சிரிக்கும் கண்களுடன் முகத்தை முத்தமிடுவது மற்றும் 😗 முத்தமிடும் முகத்தை விட மிக நெருக்கமான வெளிப்பாட்டைக் கொண்டுள்ளது."
  },
  {
    id: 21,
    emoji: "😙",
    name: "புன்னகைக்கும் கண்களுடன் முகத்தை முத்தமிடுவது",
    meaning:
      "புன்னகைக்கும் கண்களும், முத்தமிட்ட உதடுகளும் கொண்ட மஞ்சள் முகம். பொதுவாக அன்பு மற்றும் பாசத்தின் உணர்வுகளை வெளிப்படுத்துகிறது. ஆச்சரியம், போற்றுதல், அவமதிப்பு, அல்லது குற்றமற்றவர் எனக் கருதப்படுவது போன்ற உணர்ச்சிகளை வெளிப்படுத்தலாம், பாக்கெட்டில் கைகளை வைத்திருப்பவர் தவறுக்குப் பிறகு சாதாரணமாக விசில் அடிப்பதைப் போல, இங்கே பார்க்க எதுவும் இல்லை என்று சொல்வது போல. அதன் புன்னகை கண்களால், face முத்த முகத்தை விட ஒரு வெளிப்பாட்டைக் கொண்டுள்ளது, ஆனால் மூடிய கண்களுடன் முகத்தை முத்தமிடுவதை விட குறைவான நெருக்கம்."
  },
  {
    id: 22,
    emoji: "😋",
    name: "முகம் சேமிக்கும் உணவு",
    meaning:
      "புன்னகைக்கும் கண்கள் கொண்ட ஒரு மஞ்சள் முகமும், ஒரு மூலைக்கு வெளியே ஒரு நாக்கால் ஒட்டிக்கொண்டிருக்கும் ஒரு பரந்த, மூடிய புன்னகையும், அதன் உதடுகளை பசியிலோ அல்லது மனநிறைவிலோ நக்குவது போல. ஒரு உணவு பொருள் சுவையாக இருக்கிறது என்பதை தெரிவிக்க பரவலாகப் பயன்படுத்தப்படுகிறது. ஒரு நபர் கவர்ச்சிகரமானவர் என்பதையும் வெளிப்படுத்தலாம்."
  },
  {
    id: 23,
    emoji: "😛",
    name: "நாக்குடன் முகம்",
    meaning:
      "பசிறிய, திறந்த கண்கள் மற்றும் ஒரு பெரிய சிரிப்பைக் கொண்ட ஒரு மஞ்சள் முகம், அதன் நாக்கை விளையாட்டுத்தனமாக ஒட்டிக்கொண்டது. வேடிக்கை, உற்சாகம், புத்திசாலித்தனம், கட்னெஸ், மகிழ்ச்சி அல்லது கேலி போன்ற உணர்வை பல்வேறு விதமாக வெளிப்படுத்த முடியுமா?"
  },
  {
    id: 24,
    emoji: "😜",
    name: "நாக்குடன் கண் சிமிட்டும் முகம்",
    meaning:
      "ஒரு மஞ்சள் முகம் அதன் நாக்கை ஒட்டிக்கொண்டு ஒரு கண்மூடித்தனமான கண் சிமிட்டுகிறது, வழக்கமாக அதன் வலது கண்ணை மூடிக்கொண்டு இடது அகலமாக திறந்திருக்கும். பெரும்பாலும் வேடிக்கை, உற்சாகம், அசத்தல், பஃப்பனரி அல்லது நகைச்சுவை உணர்வை வெளிப்படுத்துகிறது."
  },
  {
    id: 25,
    emoji: "🤪",
    name: "வேடிக்கையான முகம்",
    meaning:
      "வேடிக்கையான முகத்தை உருவாக்கும் புன்னகை. ஒரு பெரிய புன்னகையும், அகலமான, வெண்மையான கண்களும் கொண்ட ஒரு மஞ்சள் முகம், மற்றொன்றை விட பெரியது மற்றும் காட்டு, கோக்கி வெளிப்பாட்டில். ஆப்பிள் உட்பட பல தளங்களில், அதன் நாக்கு வெளியே சிக்கி, தலை சாய்ந்திருப்பதை சித்தரிக்கிறது; மற்றவர்கள் முழு-பல் சிரிப்பைக் கொண்டுள்ளனர், இது மிகவும் அசைக்க முடியாத தோற்றத்தை அளிக்கிறது."
  },
  {
    id: 26,
    emoji: "😝",
    name: "நாக்குடன் முகம் சுறுக்குதல்",
    meaning:
      "துடைத்த, எக்ஸ் வடிவ கண்கள் மற்றும் ஒரு பெரிய புன்னகையுடன் ஒரு மஞ்சள் முகம், அதன் நாக்கை வெளியே ஒட்டிக்கொண்டது. ஸ்கீ என்று சொல்வது போல் பெரும்பாலும் வேடிக்கை, உற்சாகம், விளையாட்டுத்தன்மை, மகிழ்ச்சி மற்றும் மகிழ்ச்சி ஆகியவற்றை உணர்த்துகிறது! அல்லது அற்புதம்!"
  },
  {
    id: 27,
    emoji: "🤑",
    name: "பணம்-வாய் முகம்",
    meaning:
      "உயர்த்தப்பட்ட புருவங்களைக் கொண்ட ஒரு மஞ்சள் முகம், கண்களுக்கு டாலர் அறிகுறிகள் மற்றும் ஒரு பச்சை, டாலர் பணத்தாள்க்குப் பிறகு வடிவமைக்கப்பட்ட நாக்கை ஒட்டிக்கொண்டிருக்கும் திறந்த புன்னகை. சில தளங்கள் பச்சை-வட்டங்களில் டாலர் அடையாளம் கண்களை சித்தரிக்கின்றன."
  },
  {
    id: 28,
    emoji: "🤗",
    name: "முகத்தை கட்டிப்பிடிப்பது",
    meaning:
      "ஒரு அரவணைப்பைக் கொடுப்பது போல, திறந்த கைகளால் சிரிக்கும் ஒரு மஞ்சள் முகம். நன்றி மற்றும் ஆதரவை வழங்கவும், அன்பையும் அக்கறையையும் காட்டவும் அல்லது பொதுவாக சூடான, நேர்மறையான உணர்வுகளை வெளிப்படுத்தவும் பயன்படுத்தப்படலாம்."
  },
  {
    id: 29,
    emoji: "🤭",
    name: "கை மேலா வாய் கொண்ட முகம்",
    meaning:
      "ஒரு கையை வைத்து ஒரு மஞ்சள் முகம். ஆப்பிள் மற்றும் பேஸ்புக் அம்சங்கள் எளிமையான, திறந்த கண்களைக் கொண்டுள்ளன, யாரோ வாயை மூடிக்கொண்டு ஓ! கடுமையான ஆச்சரியம், அதிர்ச்சி, கவலை அல்லது மன்னிப்பு. மற்ற தளங்களில் புன்னகைக்கும் கண்கள் மற்றும் / அல்லது கன்னங்களை மழுங்கடிக்கும் ஒரு முகத்தை சித்தரிக்கிறது, இது நகைச்சுவையான சிரிப்பு அல்லது சங்கடத்தை பரிந்துரைக்கிறது, அச்சச்சோ!"
  },
  {
    id: 30,
    emoji: "🤫",
    name: "அமைதியான முகம்",
    meaning:
      "ஒரு மஞ்சள் முகம் ஒரு ஆள்காட்டி விரலை பின்தொடர்ந்த உதடுகளுக்கு மேல் வைத்து, ஷ்! அல்லது சுஷ்! ம .னத்திற்காக. சில தளங்களில் உயர்த்தப்பட்ட புருவங்களைக் கொண்டுள்ளது. ஆப்பிள் வடிவமைப்பு முகம் சற்று சாய்ந்து கொண்டிருப்பதைக் குறிக்கிறது."
  },
  {
    id: 31,
    emoji: "🤔",
    name: "சிந்திக்கும் முகம்",
    meaning:
      "கட்டைவிரல் மற்றும் ஆள்காட்டி விரலால் அதன் கன்னத்தில் ஓய்வெடுக்கும் உரோம புருவங்களைக் கொண்ட ஒரு மஞ்சள் முகம். ஒரு நபர் சிந்தித்துப் பார்க்கும் அல்லது ஆழமான சிந்தனையைக் காட்ட விரும்பினார். பெரும்பாலும் ஏதாவது அல்லது யாரையாவது கேள்வி கேட்பது அல்லது இகழ்வது, ஹ்ம்ம் சொல்வது போல், எனக்கு அது பற்றி தெரியாது. ஆர்வமுள்ள, விளையாட்டுத்தனமான, குழப்பமான, சந்தேகம் மற்றும் கேலி செய்வது உள்ளிட்ட தொனி மாறுபடும்."
  },
  {
    id: 32,
    emoji: "🤐",
    name: "ஜிப்பர்-வாய் முகம்",
    meaning:
      "எளிமையான, திறந்த கண்கள் மற்றும் வாய்க்கு ஒரு மூடிய ரிவிட் கொண்ட மஞ்சள் முகம். பொருள் பரவலாக மாறுபடும், ஆனால் பொதுவாக ஒரு ரகசியத்தை தெரிவிக்கிறது அல்லது யாராவது ஒன்றை வைத்திருப்பார்கள் (எ.கா., என் உதடுகள் சீல் வைக்கப்பட்டுள்ளன). ஒருவரிடம் பேசுவதை நிறுத்தச் சொல்லவும் பயன்படுத்தலாம் (எ.கா., ஜிப்! அல்லது நான் இப்போது வாயை மூடுவேன்)."
  },
  {
    id: 33,
    emoji: "🤨",
    name: "உயர்த்தப்பட்ட புருவத்துடன் முகம்",
    meaning:
      "ஒரு தட்டையான, நடுநிலை வாய் மற்றும் உரோம புருவங்களைக் கொண்ட மஞ்சள் முகம், அதன் இடது வலதுபுறத்தை விட உயரமாக உயர்ந்துள்ளது. சந்தேகம், சந்தேகம், அக்கறை, கருத்தில், அவநம்பிக்கை மற்றும் மறுப்பு உள்ளிட்ட பலவிதமான உணர்வுகளை வெளிப்படுத்துகிறது."
  },
  {
    id: 34,
    emoji: "😐",
    name: "நடுநிலை முகம்",
    meaning:
      "எளிமையான, திறந்த கண்கள் மற்றும் தட்டையான, மூடிய வாய் கொண்ட மஞ்சள் முகம். ஒரு நடுநிலை உணர்வை சித்தரிக்க நோக்கம் கொண்டது, ஆனால் பெரும்பாலும் லேசான எரிச்சல் மற்றும் அக்கறை அல்லது நகைச்சுவை உணர்வை வெளிப்படுத்த பயன்படுகிறது."
  },
  {
    id: 35,
    emoji: "😑",
    name: "வெளிப்பாடற்ற முகம்",
    meaning:
      "தட்டையான, மூடிய கண்கள் மற்றும் வாய் கொண்ட மஞ்சள் முகம். 😐 நடுநிலை முகம் பரிந்துரைத்ததை விட தீவிரமான விரக்தி அல்லது எரிச்சலை உணரலாம், தன்னைச் சேகரிக்க ஒரு கணம் எடுத்துக்கொள்வது போல."
  },
  {
    id: 36,
    emoji: "😶",
    name: "வாய் இல்லாத முகம்",
    meaning:
      "எளிமையான, திறந்த கண்கள் மற்றும் வாய் இல்லாத மஞ்சள் முகம், வார்த்தைகளுக்கு இழப்பு ஏற்படுவது போல. பொருள் பரவலாக மாறுபடுகிறது, ஆனால் பொதுவாக பேச்சு, மனத்தாழ்மை மற்றும் ம .னத்தை வெளிப்படுத்துகிறது. ஏமாற்றம், விரக்தி அல்லது சோகம் போன்ற மிதமான எதிர்மறை உணர்ச்சிகளையும் தெரிவிக்கலாம்."
  },
  {
    id: 37,
    emoji: "😏",
    name: "சிரிக்கும் முகம்",
    meaning:
      "ஒரு மஞ்சள் முகம், நயவஞ்சகமான, குறும்புக்கார, அல்லது அறிவுறுத்தும் முகபாவனை. இது அரை புன்னகை, உயர்த்தப்பட்ட புருவங்கள் மற்றும் பக்கவாட்டில் பார்க்கும் கண்கள் ஆகியவற்றைக் கொண்டுள்ளது. உல்லாசமாக அல்லது பாலியல் புத்திசாலித்தனத்தை வெளிப்படுத்த பெரும்பாலும் பயன்படுத்தப்படுகிறது."
  },
  {
    id: 38,
    emoji: "😒",
    name: "பயன்படுத்தப்படாத முகம்",
    meaning:
      "சற்றே உயர்த்தப்பட்ட புருவங்களைக் கொண்ட ஒரு மஞ்சள் முகம், ஒரு கோபம், மற்றும் கண்கள் பக்கமாகப் பார்க்கின்றன. எரிச்சல், அதிருப்தி, எரிச்சல், சந்தேகம் உள்ளிட்ட பலவிதமான எதிர்மறை உணர்ச்சிகளை பக்கக் கண்ணைக் கொடுப்பது போல வெளிப்படுத்தலாம்."
  },
  {
    id: 39,
    emoji: "🙄",
    name: "ரோலிங் உருட்டும் கண்களுடன் முகம்",
    meaning:
      "ஒரு சிறிய, மூடிய வாய், தட்டையான அல்லது கோபத்துடன் ஒரு மஞ்சள் முகம், அதன் பெரிய, வெள்ளை கண்களை மேல்நோக்கி உருட்டுகிறது. கண்-ரோலின் சைகையைப் போலவே, பொதுவாக மிதமான அவமதிப்பு, மறுப்பு, விரக்தி அல்லது சலிப்பு ஆகியவற்றை வெளிப்படுத்துகிறது. விளையாட்டு, சசி, மனக்கசப்பு மற்றும் கிண்டல் உள்ளிட்ட தொனி மாறுபடும், ஆம், எதுவாக இருந்தாலும்"
  },
  {
    id: 40,
    emoji: "😬",
    name: "கடுமையான முகம்",
    meaning:
      "எளிமையான திறந்த கண்கள் கொண்ட மஞ்சள் முகம் எதிர்மறை அல்லது பதட்டமான உணர்ச்சிகளின் வரம்பைக் குறிக்கலாம், குறிப்பாக பதட்டம், சங்கடம் அல்லது மோசமான தன்மை (எ.கா., ஈக்!)."
  },
  {
    id: 41,
    emoji: "🤥",
    name: "பொய் முகம்",
    meaning:
      "உயர்த்தப்பட்ட புருவங்கள், விரிவாக்கப்பட்ட கண்கள், லேசான கோபம் மற்றும் நீண்ட மூக்கு கொண்ட மஞ்சள் முகம், இது பினோச்சியோவின் முறையில் ஒரு பொய்யைக் கூறுகிறது என்பதைக் குறிக்கிறது. அந்த கதாபாத்திரத்தைப் போலவே, பேஸ்புக்கின் வடிவமைப்பிலும் மர மூக்கு உள்ளது."
  },
  {
    id: 42,
    emoji: "😌",
    name: "நிம்மதியான முகம்",
    meaning:
      "மென்மையான, மூடிய கண்கள், உயர்த்தப்பட்ட புருவங்கள் மற்றும் லேசான புன்னகையுடன் மஞ்சள் முகம். பேஸ்புக்கின் வடிவமைப்பு சற்று திறந்த வாயைக் கொண்டுள்ளது, பெருமூச்சு விடுகிறது."
  },
  {
    id: 43,
    emoji: "😪",
    name: "தூக்க முகம்",
    meaning:
      "மூடிய கண்கள் கொண்ட மஞ்சள் முகம், வாய் சற்று திறந்திருக்கும், அதன் மூக்கிலிருந்து ஒரு நீல நிற ஸ்னோட் குமிழி வருகிறது. ஸ்னோட் குமிழ்கள் ஒரு பாத்திரம் சோர்வாக அல்லது அனிம் அல்லது மங்காவில் தூங்குவதைக் குறிக்கிறது. 😴 தூங்கும் முகத்துடன் குழப்பமடையக்கூடாது"
  },
  {
    id: 44,
    emoji: "🤤",
    name: "ட்ரூலிங் முகம்",
    meaning:
      "ஒரு மஞ்சள் முகம், பொதுவாக மூடிய கண்கள் மற்றும் உயர்த்தப்பட்ட புருவங்களுடன் காட்டப்படுகிறது, அதன் வாயின் ஒரு மூலையிலிருந்து உமிழ்நீர் வீசுகிறது. ஒரு நபர் (கவர்ச்சியான, கவர்ச்சிகரமான) அல்லது பொருளின் (எ.கா., சுவையான உணவு) விருப்பத்தை காட்ட பெரும்பாலும் பயன்படுத்தப்படுகிறது. யாராவது சோர்வாக அல்லது தூங்கிக்கொண்டிருப்பதைக் குறிக்கலாம்."
  },
  {
    id: 45,
    emoji: "😴",
    name: "தூங்கும் முகம்",
    meaning:
      "கண்களை மூடிய ஒரு மஞ்சள் முகம் மற்றும் மூன்று, கார்ட்டூன் பாணியில் Zzz இன் மேல்நோக்கி வெளியேறுகிறது. Zzz கள் பெரும்பாலான தளங்களில் நீலம் அல்லது ஊதா நிறத்தில் தோன்றும். சலிப்பையும் குறிக்கலாம் (ஸ்லாங், உறக்கநிலை)."
  },
  {
    id: 46,
    emoji: "😷",
    name: "மருத்துவ முகமூடியுடன் முகம்",
    meaning:
      "ஒரு வெள்ளை அறுவை சிகிச்சை முகமூடியை அணிந்த மஞ்சள் முகம், ஒரு தொற்றுநோய்களின் போது மருத்துவமனைகளில் உள்ள சுகாதார ஊழியர்களும் பொது மக்களும் பயன்படுத்துகின்றனர். நோய் அல்லது வான்வழி நோய்கள் பரவாமல் இருக்க அணியலாம்."
  },
  {
    id: 47,
    emoji: "🤒",
    name: "வெப்பமானியுடன் முகம்",
    meaning:
      "உயர்த்தப்பட்ட அல்லது உரோம புருவங்களைக் கொண்ட மஞ்சள் முகம் மற்றும் அதன் வாயில் ஒரு தெர்மோமீட்டர். பெரும்பாலும் சிவப்பு கன்னங்களால் சித்தரிக்கப்படுகிறது, காய்ச்சல் போல. ஒரு மருத்துவமனை நோயாளி அல்லது சளி அல்லது காய்ச்சல் உள்ள நபரைக் குறிக்க பயன்படுத்தப்படலாம்."
  },
  {
    id: 48,
    emoji: "🤕",
    name: "தலை-கட்டுடன் முகம்",
    meaning:
      "தலையில் சுற்றப்பட்ட அரை முகம் மற்றும் வெள்ளை கட்டு கொண்ட மஞ்சள் முகம், பெரும்பாலும் ஒரு கண்ணுக்கு மேல் ஓரளவு சித்தரிக்கப்படுகிறது. உடல் காயம் அல்லது வலியைக் குறிக்கலாம், ஆனால் உணர்ச்சிவசப்படுவதையும் இருக்கலாம், சில நேரங்களில் முரண்பாடான விளைவுக்கு."
  }
];

export default emojipedia;
